; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 406379 2 3 4 6 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image1 - mode
	spectrograph3 - mode
	spectrograph2 - mode
	thermograph0 - mode
	Star3 - direction
	Star2 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star4 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph3)
	(supports instrument0 image1)
	(calibration_target instrument0 Star3)
	(supports instrument1 image1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph3)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph3)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star4)
	(supports instrument4 spectrograph3)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
)
(:goal (and
	(have_image Planet6 spectrograph2)
	(have_image Planet7 image1)
	(have_image Star8 image1)
	(have_image Star9 spectrograph3)
	(have_image Star10 image1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (turn_to satellite1 planet6 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet6)
   goals met: 0 of 5
4. (turn_to satellite0 groundstation1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 5
5. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 5
6. (turn_to satellite1 groundstation1 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 5
7. (turn_to satellite0 star9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star9)
   goals met: 0 of 5
8. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 5
9. (take_image satellite0 star9 instrument1 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 1 of 5
10. (turn_to satellite1 planet6 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet6)
   goals met: 1 of 5
11. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   goals met: 1 of 5
12. (take_image satellite1 planet6 instrument2 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 2 of 5
13. (take_image satellite0 star10 instrument1 image1)
   added: (have_image star10 image1)
   goals met: 3 of 5
14. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 3 of 5
15. (turn_to satellite0 planet7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet7)
   goals met: 3 of 5
16. (turn_to satellite1 star4 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star4)
   goals met: 3 of 5
17. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 3 of 5
18. (take_image satellite0 planet7 instrument1 image1)
   added: (have_image planet7 image1)
   goals met: 4 of 5
19. (calibrate satellite1 instrument4 star4)
   added: (calibrated instrument4)
   goals met: 4 of 5
20. (turn_to satellite0 star8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star8)
   goals met: 4 of 5
21. (turn_to satellite1 star8 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star8)
   goals met: 4 of 5
22. (take_image satellite0 star8 instrument1 image1)
   added: (have_image star8 image1)
   goals met: 5 of 5
